#ifndef __BSP__LED_H
#define __BSP__LED_H
/***********************************************************************************************************************************
 ** 【文件名称】  led.h
 ** 【编写人员】  荣洋电子-李工
 ** 【淘    宝】  荣洋电子RYDZ      https://shop572511740.taobao.com/?spm=pc_detail.29232929/evo365560b447259.shop_block.dshopinfo.296e7dd6rGcJmq
 ***********************************************************************************************************************************
 ** 【文件功能】  简化常用的系统函数、初始化函数
 **                
 ** 【硬件重点】  1- 注意LED是代电平还是高电平点亮，可查原理图
 **               2- 
 **
 ** 【代码重点】  1- 引脚工作模式：推挽输出
 **
 ** 【移植说明】  
 **
 ** 【更新记录】  
 **
***********************************************************************************************************************************/  
#include "stm32f4xx.h"
#include <stdio.h>




void Led_Init(void);
void LED_On(void);
void LED_Off(void);


#endif

