/***********************************************************************************************************************************
 ** 【文件名称】  Delay.c
 ** 【编写人员】  荣洋电子-李工
 ** 【淘宝店铺】  荣洋电子      https://shop572511740.taobao.com/?spm=pc_detail.29232929/evo365560b447259.shop_block.dshopinfo.296e7dd6rGcJmq  
 ***********************************************************************************************************************************
 ** 【文件功能】  实现微秒(us)和毫秒(ms)级别的延迟函数，使用SysTick定时器实现精确的延迟控制
 ** 
 ** 【移植说明】  在移植到其他平台时，需要根据目标平台的硬件配置和时钟频率调整延迟函数的参数
 ** 
 ** 【更新记录】  2024-01-08  初始版本，实现微秒和毫秒延迟功能
***********************************************************************************************************************************/
#include "Delay.h"




void delay_ms(uint32_t ms)                     // 定义一个ms延时函数，减少移植时对外部文件依赖; 本函数仅作粗略延时使用，而并非精准延时;
{
    ms = ms * 42001;                                  // 注意：此参考值运行条件：打勾 Options/ c++ / One ELF Section per Function
    for (uint32_t i = 0; i < ms; i++);                // 注意系统时钟下，大约多少个空循环耗时1ms
}

void delay_us(uint16_t time){
	u32 temp = 0;
	SysTick -> LOAD = time * 9;
	SysTick -> CTRL = SysTick_CTRL_ENABLE_Msk;//使能时钟
	SysTick -> VAL  = 0;//清零计数器
	while(!(temp & SysTick_CTRL_COUNTFLAG_Msk))
		temp = SysTick -> CTRL;;
	return;
}
